tutorials/multiphase/multiphaseEulerFoam/laminar/titaniaSynthesis/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    outlet;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1           (0.435 0 0);
            p2           (0.44 0 0);
            radius       0.015875;
        }
    }

    {
        name    outlet;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set  outlet;
        }
    }
);

// ************************************************************************* //
